app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
---
    public function obtenerUsuarios() {
        return $this->findAll();